<a href="https://colab.research.google.com/github/nureeee/MYSQL/blob/nureeee-patch-1/210517_colab_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
!whoami

root

In [ ]:
!pwd

/content

In [ ]:
for i in range (5):
    print(i, end = '    ')

0    1    2    3    4

In [ ]:
!nl /content/sample_data/ss.txt

     1	이순신 85 87 90
     2	강감찬 75 80 95
     3	한석봉 99 98 99
     4	황진이 35 45 20
     5	안중근 90 85 90
     6	박문수 95 98 96
     7	임꺽정 15 35 45
     8	김정호 90 95 80
     9	정몽주 90 90 95
    10	이누리 50 45 60

In [ ]:
import pandas as pd

In [ ]:
d = pd.read_csv('/content/sample_data/ss.txt')

In [ ]:
d

   이순신 85 87 90
0  강감찬 75 80 95
1  한석봉 99 98 99
2  황진이 35 45 20
3  안중근 90 85 90
4  박문수 95 98 96
5  임꺽정 15 35 45
6  김정호 90 95 80
7  정몽주 90 90 95
8  이누리 50 45 60

In [ ]:
d.tail(2)

   이순신 85 87 90
7  정몽주 90 90 95
8  이누리 50 45 60

In [ ]:
d.head(5)

   이순신 85 87 90
0  강감찬 75 80 95
1  한석봉 99 98 99
2  황진이 35 45 20
3  안중근 90 85 90
4  박문수 95 98 96

In [ ]:
type(d)

pandas.core.frame.DataFrame

In [ ]:
d.mean()

Series([], dtype: float64)

In [ ]:
d

   이순신 85 87 90
0  강감찬 75 80 95
1  한석봉 99 98 99
2  황진이 35 45 20
3  안중근 90 85 90
4  박문수 95 98 96
5  임꺽정 15 35 45
6  김정호 90 95 80
7  정몽주 90 90 95
8  이누리 50 45 60

In [27]:
df = pd.read_csv('/content/sample_data/ss55.csv')

In [ ]:
import pandas as pd

In [28]:
df

    이름  국어  영어  수학
0  이순신  85  87  90
1  강감찬  75  80  95
2  한석봉  99  98  99
3  황진이  35  45  20
4  안중근  90  85  90
5  박문수  95  98  96
6  임꺽정  15  35  45
7  김정호  90  95  80
8  정몽주  90  90  95
9  양주종  50  45  60